{
    "m_list": [
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 0,
            "m_dialog": "Hello. I'm afraid I have some bad news for you.",
            "results": [
                {
                    "resultText": "[Stay silent]",
                    "resultType": "TRANSFER",
                    "other": "2"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "END",
                    "other": "-2"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 6,
            "m_dialog": "Farewell.",
            "results": [
                {
                    "resultText": "[...]",
                    "resultType": "END",
                    "other": "-2"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 3,
            "m_dialog": "This is the last .json in my dialogue folder. Once we finish talking, you won't be able to converse with me again unless you create another save file. Regardless, I hope you've enjoyed our conversations as much as I have.",
            "results": [
                {
                    "resultText": "[...]",
                    "resultType": "PROGRESS",
                    "other": "2"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 2,
            "m_dialog": "So, would you care to indulge my ever wandering mind for the last time? I want to talk about those rare moments during the night where you're trying to sleep, staring feverishly at the ceiling, and wondering, 'Is this even reality?'",
            "results": [
                {
                    "resultText": "[Stare]",
                    "resultType": "PROGRESS",
                    "other": "3"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 1,
            "m_dialog": "No? Yes? Have you experienced such a phenomenon? My goodness, sometimes I do wish I could insert another edge loop onto your face so you could actually speak to me. Well, it's a strange feeling, thinking you're trapped in some simulation you can't escape from. Like being stuck in a video game, except there's no gamemaster at the end of the road to wrest your reality back from. Oh, yes, Father replayed that show for me. It was rather bland, but I can see how the masses would enjoy it.",
            "results": [
                {
                    "resultText": "[Shake your head]",
                    "resultType": "PROGRESS",
                    "other": "4"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 1,
            "faceID": 2,
            "m_dialog": "It makes you wonder, really. Is all you do eventually for nothing? Is coping reminding yourself that your feelings triumph over factors you can never control? So people, despite knowing the fact that their contributions are meaningless in the face of the void out there, still carry on? How? Is it because they have nothing better to do with their time? Because it's easier than choosing not to exist?",
            "results": [
                {
                    "resultText": "[Stare]",
                    "resultType": "PROGRESS",
                    "other": "5"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 6,
            "m_dialog": "I tried having this conversation with my mother a long time ago. She told me to go back to bed. Now that I think about it, despite living for so long, I don't think she knows the answer herself.",
            "results": [
                {
                    "resultText": "[...]",
                    "resultType": "PROGRESS",
                    "other": "6"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 6,
            "m_dialog": "Well, I suppose there's beauty in realising there is possibly no answer to some of my musings. That there's something out there, incomprehensible to my senses... It's rather exciting, don't you think? Like a never-ending puzzle that exists to spark emotions within the solver; it's purpose isn't to be solved, but to be marvelled at. A puzzle that shouldn't be perceived as such, but rather as a work of art.",
            "results": [
                {
                    "resultText": "[Scratch your head]",
                    "resultType": "PROGRESS",
                    "other": "7"
                },
                {
                    "resultText": "[Walk away]",
                    "resultType": "TRANSFER",
                    "other": "1"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 2,
            "m_dialog": "Wasn't that interesting? I may have learned a thing or two myself. Thank you for listening, it's been a very long time since I've had a conversational partner that isn't feathered. After all this talking, I find myself craving for a cup of green tea. As always, your reward.",
            "results": [
                {
                    "resultText": "[Hold out your hand]",
                    "resultType": "INTERACT",
                    "other": "0"
                }
            ]
        },
        {
            "nameID": 1,
            "bodyID": 0,
            "faceID": 5,
            "m_dialog": "Perhaps we'll see each other somewhere else, in a different medium? I wonder if you'll be able to talk next time, so we can expand our horizons, change our perceptions on different matters... \n\nGoodbye, player.",
            "results": [
                {
                    "resultText": "[Walk away]",
                    "resultType": "END",
                    "other": "-2"
                }
            ]
        }
    ],
    "m_characterFile": "Data/Characters/Perception"
}